; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 4548)
	(= (fuel plane1) 887)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 4)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city3)
	(= (capacity plane2) 5736)
	(= (fuel plane2) 1540)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 4)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 4)
	(at plane3 city4)
	(= (capacity plane3) 5528)
	(= (fuel plane3) 494)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at plane4 city5)
	(= (capacity plane4) 4972)
	(= (fuel plane4) 872)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 6)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 2)
	(at plane5 city2)
	(= (capacity plane5) 10627)
	(= (fuel plane5) 670)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 15)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 3)
	(at person1 city3)
	(at person2 city1)
	(at person3 city4)
	(at person4 city4)
	(at person5 city4)
	(at person6 city1)
	(at person7 city2)
	(at person8 city3)
	(at person9 city4)
	(at person10 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 780)
	(= (distance city0 city2) 612)
	(= (distance city0 city3) 696)
	(= (distance city0 city4) 721)
	(= (distance city0 city5) 642)
	(= (distance city1 city0) 780)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 572)
	(= (distance city1 city3) 781)
	(= (distance city1 city4) 932)
	(= (distance city1 city5) 947)
	(= (distance city2 city0) 612)
	(= (distance city2 city1) 572)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 615)
	(= (distance city2 city4) 502)
	(= (distance city2 city5) 730)
	(= (distance city3 city0) 696)
	(= (distance city3 city1) 781)
	(= (distance city3 city2) 615)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 588)
	(= (distance city3 city5) 813)
	(= (distance city4 city0) 721)
	(= (distance city4 city1) 932)
	(= (distance city4 city2) 502)
	(= (distance city4 city3) 588)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 972)
	(= (distance city5 city0) 642)
	(= (distance city5 city1) 947)
	(= (distance city5 city2) 730)
	(= (distance city5 city3) 813)
	(= (distance city5 city4) 972)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at plane3 city1)
	(at plane5 city0)
	(at person2 city2)
	(at person3 city2)
	(at person4 city3)
	(at person5 city5)
	(at person6 city3)
	(at person7 city3)
	(at person8 city2)
	(at person9 city3)
	(at person10 city5)
	))

(:metric minimize (+ (* 2 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane3 city4)
   changed: (fuel plane3) from 494 to 5528
   goals met: 0 of 12
2. (board person4 plane3 city4)
   deleted: (at person4 city4)
   added: (in person4 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 12
3. (board person3 plane3 city4)
   deleted: (at person3 city4)
   added: (in person3 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 0 of 12
4. (board person5 plane3 city4)
   deleted: (at person5 city4)
   added: (in person5 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 0 of 12
5. (board person8 plane2 city3)
   deleted: (at person8 city3)
   added: (in person8 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 12
6. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 1230, (fuel plane2) from 1540 to 310
   goals met: 0 of 12
7. (debark person8 plane2 city2)
   deleted: (in person8 plane2)
   added: (at person8 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 1 of 12
8. (fly plane3 city4 city1)
   deleted: (at plane3 city4)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 1230 to 3094, (fuel plane3) from 5528 to 3664
   goals met: 2 of 12
9. (board person6 plane3 city1)
   deleted: (at person6 city1)
   added: (in person6 plane3)
   changed: (onboard plane3) from 3 to 4
   goals met: 2 of 12
10. (board person2 plane3 city1)
   deleted: (at person2 city1)
   added: (in person2 plane3)
   changed: (onboard plane3) from 4 to 5
   goals met: 2 of 12
11. (refuel plane5 city2)
   changed: (fuel plane5) from 670 to 10627
   goals met: 2 of 12
12. (zoom plane5 city2 city0)
   deleted: (at plane5 city2)
   added: (at plane5 city0)
   changed: (total-fuel-used) from 3094 to 12274, (fuel plane5) from 10627 to 1447
   goals met: 3 of 12
13. (fly plane3 city1 city2)
   deleted: (at plane3 city1)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 12274 to 13418, (fuel plane3) from 3664 to 2520
   goals met: 2 of 12
14. (debark person2 plane3 city2)
   deleted: (in person2 plane3)
   added: (at person2 city2)
   changed: (onboard plane3) from 5 to 4
   goals met: 3 of 12
15. (debark person3 plane3 city2)
   deleted: (in person3 plane3)
   added: (at person3 city2)
   changed: (onboard plane3) from 4 to 3
   goals met: 4 of 12
16. (board person7 plane3 city2)
   deleted: (at person7 city2)
   added: (in person7 plane3)
   changed: (onboard plane3) from 3 to 4
   goals met: 4 of 12
17. (refuel plane1 city5)
   changed: (fuel plane1) from 887 to 4548
   goals met: 4 of 12
18. (fly plane1 city5 city4)
   deleted: (at plane1 city5)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 13418 to 15362, (fuel plane1) from 4548 to 2604
   goals met: 4 of 12
19. (board person9 plane1 city4)
   deleted: (at person9 city4)
   added: (in person9 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 12
20. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 15362 to 16538, (fuel plane1) from 2604 to 1428
   goals met: 4 of 12
21. (debark person9 plane1 city3)
   deleted: (in person9 plane1)
   added: (at person9 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 12
22. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 16538 to 17930, (fuel plane1) from 1428 to 36
   goals met: 6 of 12
23. (fly plane3 city2 city1)
   deleted: (at plane3 city2)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 17930 to 19074, (fuel plane3) from 2520 to 1376
   goals met: 7 of 12
24. (refuel plane3 city1)
   changed: (fuel plane3) from 1376 to 5528
   goals met: 7 of 12
25. (board person10 plane3 city1)
   deleted: (at person10 city1)
   added: (in person10 plane3)
   changed: (onboard plane3) from 4 to 5
   goals met: 7 of 12
26. (fly plane3 city1 city3)
   deleted: (at plane3 city1)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 19074 to 20636, (fuel plane3) from 5528 to 3966
   goals met: 6 of 12
27. (debark person4 plane3 city3)
   deleted: (in person4 plane3)
   added: (at person4 city3)
   changed: (onboard plane3) from 5 to 4
   goals met: 7 of 12
28. (debark person6 plane3 city3)
   deleted: (in person6 plane3)
   added: (at person6 city3)
   changed: (onboard plane3) from 4 to 3
   goals met: 8 of 12
29. (debark person7 plane3 city3)
   deleted: (in person7 plane3)
   added: (at person7 city3)
   changed: (onboard plane3) from 3 to 2
   goals met: 9 of 12
30. (fly plane3 city3 city5)
   deleted: (at plane3 city3)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 20636 to 22262, (fuel plane3) from 3966 to 2340
   goals met: 9 of 12
31. (debark person5 plane3 city5)
   deleted: (in person5 plane3)
   added: (at person5 city5)
   changed: (onboard plane3) from 2 to 1
   goals met: 10 of 12
32. (debark person10 plane3 city5)
   deleted: (in person10 plane3)
   added: (at person10 city5)
   changed: (onboard plane3) from 1 to 0
   goals met: 11 of 12
33. (fly plane3 city5 city1)
   deleted: (at plane3 city5)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 22262 to 24156, (fuel plane3) from 2340 to 446
   goals met: 12 of 12
